package org.example.skypro;

public class Task25 {
    static final int III = 10;
    static final byte BBB = 10;

   /*
   1. Для создания литерала типа int, нам необходимо определить значение этого литерала. Например,
   пусть значение int будет равно 10.
2. Система резервирует память для хранения значения типа int, обычно в 4 байта.
3. Значение 10 преобразуется в двоичное представление (в случае int значение может быть от -2147483648 до 2147483647).
4. Двоичное представление значения 10 записывается в зарезервированную память, в результате этого создается литерал
типа int, занимающий 4 байта памяти.

Сейчас рассмотрим алгоритм составления литерала типа byte:

1. Для создания литерала типа byte, мы также должны определить значение этого литерала. Например,
пусть значение byte будет равно 5.
2. Система резервирует память для хранения значения типа byte, обычно в 1 байт.
3. Значение 5 преобразуется в двоичное представление (в случае byte значение может быть от -128 до 127).
4. Двоичное представление значения 5 записывается в зарезервированную память, в результате этого создается литерал
типа byte, занимающий 1 байт памяти.

Таким образом, при создании литералов типа int и byte система резервирует соответствующее количество памяти для
 хранения этих значений, располагает их в этой памяти и обеспечивает доступ к этим значениям по необходимости.
   *
   */
}
